<template>
  <footer>
    <div class="container">
      <div class="footer__info">
        <div class="footer__contacts">
          <div v-if="siteInfo.address" class="footer__contacts-item">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M10.0006 19V14H14.0006V19C14.0006 19.55 14.4506 20 15.0006 20H18.0006C18.5506 20 19.0006 19.55 19.0006 19V12H20.7006C21.1606 12 21.3806 11.43 21.0306 11.13L12.6706 3.59997C12.2906 3.25997 11.7106 3.25997 11.3306 3.59997L2.97059 11.13C2.63059 11.43 2.84059 12 3.30059 12H5.00059V19C5.00059 19.55 5.45059 20 6.00059 20H9.00059C9.55059 20 10.0006 19.55 10.0006 19Z" fill="black"/>
            </svg>
            {{ siteInfo.address }}
          </div>
          <a v-if="siteInfo.phone" :href="'tel:' + siteInfo.phone" class="footer__contacts-item">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M21.7388 16.4138C21.5716 17.6841 20.9477 18.8502 19.9837 19.6942C19.0196 20.5382 17.7813 21.0023 16.5 21.0001C9.05626 21.0001 3.00001 14.9438 3.00001 7.50005C2.99771 6.21876 3.4619 4.98045 4.30588 4.01639C5.14986 3.05234 6.31592 2.42847 7.58626 2.2613C7.9075 2.22208 8.2328 2.2878 8.51362 2.44865C8.79444 2.60951 9.0157 2.85687 9.14438 3.1538L11.1244 7.57412V7.58537C11.2229 7.81267 11.2636 8.06083 11.2428 8.30769C11.222 8.55455 11.1404 8.79242 11.0053 9.00005C10.9884 9.02537 10.9706 9.0488 10.9519 9.07224L9.00001 11.386C9.7022 12.8129 11.1947 14.2922 12.6403 14.9963L14.9222 13.0547C14.9446 13.0359 14.9681 13.0184 14.9925 13.0022C15.2 12.8639 15.4387 12.7794 15.687 12.7565C15.9353 12.7336 16.1854 12.7729 16.4147 12.871L16.4269 12.8766L20.8434 14.8557C21.1409 14.9839 21.3889 15.205 21.5503 15.4858C21.7116 15.7667 21.7778 16.0922 21.7388 16.4138Z" fill="black"/>
            </svg>
            {{ siteInfo.phone }}
          </a>
          <a v-if="siteInfo.email" :href="'mailto:' + siteInfo.email" class="footer__contacts-item">
            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M19.875 3.75H4.125C3.42904 3.75074 2.76179 4.02755 2.26967 4.51967C1.77755 5.01179 1.50074 5.67904 1.5 6.375V17.625C1.50074 18.321 1.77755 18.9882 2.26967 19.4803C2.76179 19.9725 3.42904 20.2493 4.125 20.25H19.875C20.571 20.2493 21.2382 19.9725 21.7303 19.4803C22.2225 18.9882 22.4993 18.321 22.5 17.625V6.375C22.4993 5.67904 22.2225 5.01179 21.7303 4.51967C21.2382 4.02755 20.571 3.75074 19.875 3.75ZM19.2103 8.09203L12.4603 13.342C12.3287 13.4444 12.1667 13.4999 12 13.4999C11.8333 13.4999 11.6713 13.4444 11.5397 13.342L4.78969 8.09203C4.71038 8.03214 4.64377 7.95709 4.59372 7.87123C4.54367 7.78537 4.51118 7.69042 4.49815 7.5919C4.48511 7.49338 4.49179 7.39325 4.51778 7.29733C4.54378 7.20142 4.58858 7.11162 4.64958 7.03316C4.71058 6.95471 4.78656 6.88916 4.87312 6.84032C4.95967 6.79149 5.05506 6.76034 5.15376 6.74869C5.25245 6.73704 5.35248 6.74513 5.44802 6.77247C5.54357 6.79981 5.63272 6.84587 5.71031 6.90797L12 11.7998L18.2897 6.90797C18.447 6.7892 18.6447 6.73711 18.84 6.76296C19.0354 6.78881 19.2128 6.89053 19.3338 7.04612C19.4547 7.20171 19.5096 7.39866 19.4865 7.59439C19.4634 7.79011 19.3642 7.96888 19.2103 8.09203Z" fill="black"/>
            </svg>
            {{ siteInfo.email }}
          </a>
        </div>
        <div class="footer__policy">
          <RouterLink :to="{ name: 'delivery' }">
            Условия доставки товара
          </RouterLink>


          <RouterLink :to="{ name: 'return-and-exchange' }">
            Возврат и обмен
          </RouterLink>

          <RouterLink :to="{ name: 'policy' }">
            Политика конфиденциальности
          </RouterLink>
        </div>
      </div>
      <div class="footer__organization">
        {{ siteInfo.organization_name ? siteInfo.organization_name : "" }}
        {{ siteInfo.inn ? "ИНН: " + siteInfo.inn : "" }}
        {{ siteInfo.kpp ? "КПП: " + siteInfo.kpp : "" }}
        {{ siteInfo.ogrn ? "ОГРН: " + siteInfo.ogrn : "" }}
        {{ siteInfo.ogrnip ? "ОГРНИП: " + siteInfo.ogrnip : "" }}
      </div>

      <BannerFooter/>

    </div>

  </footer>
</template>

<script setup>

import BannerFooter from "./BannerFooter.vue";
import { getCurrentInstance, computed } from 'vue';
const { proxy } = getCurrentInstance();

const siteInfo = computed(() => proxy.$store.siteInfo.siteInfo);

</script>
